{"pageProps":{"post":{"title":"React Hooks: How to Use useMemo","date":"2021-03-05T21:29:51.159Z","content":"\n>\"In computing, memoization or memoisation is an optimization technique used primarily to speed up computer programs by storing the results of expensive function calls and returning the cached result when the same inputs occur again.\"  \n[Memoization - Wikipedia](https://en.wikipedia.org/wiki/Memoization)\n\n`useMemo` is a hook used to memoize values inside a React component. It's a performance optimization to avoid recalculating expensive values on every render. You might be familiar with React's `memo` function, which is similar, but is used to memoize React components themselves, to avoid said re-renders in the first place.\n\nThe TypeScript function signature of `useMemo`:\n\n```ts\ntype useMemo = <T>(factory: () => T, deps: Array<any>) => T;\n```\n\nThe first argument is a factory function returning the value we want to memoize. Like `useEffect` and `useCallback`, the second argument to this hook, `deps`, is a dependency array. Changes to the values passed to this array will trigger our factory function to rerun, returning a new value. If the values in the dependency array do not change, we'll instead receive the memoized value saved during the most recent execution of the factory function.\n\n## Example\n```jsx\nfunction Todos({ todos, filterByStatus }) {\n  const filteredTodos = useMemo(() => {\n    return todos.filter(todo => todo.status === filterByStatus);\n  }, [todos, filterByStatus]);\n\n  return (\n    <ul>\n      {filteredTodos.map((todo, i) =>\n        <li key={i}>{todo.name}</li>\n      )}\n    </ul>\n  );\n}\n```\n\nWe receive the props `todos`, an array of todo objects, and `filterByStatus`, a string indicating the status we want to filter by, such as 'completed', 'in-progress', etc. If todo objects are added or removed from the `todos` array, that will affect the resulting `filteredTodos`. Likewise, the result will change if our `filterByStatus` changes from 'in-progress' to 'completed'. We include both of these variables in the dependency array to signal to `useMemo` that changes to these variables should trigger a recalculation of our computed `filteredTodos` value.\n\nNote that for `useMemo` to detect that the `todos` array is unchanged between renders, it must be equal by reference. The variables included in the dependency array will be compared to their previous values using strict equality (`===`). Remember that arrays, objects, and functions are only equal by reference:\n```js\n[1, 2, 3] === [1, 2, 3] // false\nlet x = [1, 2, 3];\nx === x // true;\n```\n\nUsing our example with the `todos` array prop, if that prop comes from a parent component storing the value as state:\n```js\nconst [todos, setTodos] = useState([]);\n```\n...then `todos` will remain referentially equal _until_ `setTodos` is called. You can test this out for yourself, by placing a `console.log` statement inside your `useMemo`'s factory function, to see when it is triggered.\n\n`useMemo` has a lot of concepts in common with `useEffect` and `useCallback`, and yet, at least to me, `useMemo` is a lot easier to understand. Perhaps that's because it seems less intuitive to memoize functions, in the case of `useEffect` and `useCallback`.\n\nFor a more detailed explanation of the dependency array, and other related concepts, you can check out:\n* My post on useEffect: [React Hooks: How to Use useEffect](/blog/react-hooks-how-to-use-useeffect)\n* [Object & array dependencies in the React useEffect Hook](https://www.benmvp.com/blog/object-array-dependencies-react-useEffect-hook)\n\n","slug":"react-hooks-how-to-use-usememo"}},"__N_SSG":true}